---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.PowerFactor
source: html/7405e1a0-4546-1c1c-0584-a34b4a65d162.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.PowerFactor Property

The PowerFactor value of the Electrical System.

## Syntax (C#)
```csharp
public double PowerFactor { get; }
```

## Remarks
This property is used to retrieve the PowerFactor value of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!